### PANDAS
- Pandas kütüphanesi veri analizi için kullanılan bir kütüphanedir.
- Panel Data'dan gelmektedir.
- Yapısal verilerle çalışmak için kullanılır.
- Veri manipülasyonu ve analizi için yazılmış açık kaynaklı bir Python kütüphanesidir.
- Ekonometrik ve finansal verilerle çalışmak için kullanılır.
- 2008 yılında Wes McKinney tarafından geliştirilmiştir.

pip install pandas komutu ile pandas kütüphanesini kurabiliriz.

In [3]:
pip install pandas

^C
Note: you may need to restart the kernel to use updated packages.

Collecting pandas
  Downloading pandas-2.0.1-cp311-cp311-win_amd64.whl (10.6 MB)
     ---------------------------------------- 10.6/10.6 MB 2.6 MB/s eta 0:00:00
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\leman\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.8.2)
Collecting pytz>=2020.1
  Downloading pytz-2023.3-py2.py3-none-any.whl (502 kB)
     -------------------------------------- 502.3/502.3 kB 2.2 MB/s eta 0:00:00
Collecting tzdata>=2022.1
  Downloading tzdata-2023.3-py2.py3-none-any.whl (341 kB)
     -------------------------------------- 341.8/341.8 kB 3.0 MB/s eta 0:00:00
Requirement already satisfied: numpy>=1.21.0 in c:\users\leman\appdata\local\programs\python\python311\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\leman\appdata\local\programs\python\python311\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.0.1 pytz-2023.3 tzdata-2023.3

[notice] A new release of pip available: 22.3.1 -> 23.1.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [4]:
""" 
Pandas Serisi Oluşturma:
pd.Series() ile pandas serisi oluşturabiliriz.

"""
import pandas as pd
import numpy as np
seri= pd.Series([1,2,3,4,5,6,7,8,9])
print(seri)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [5]:
type(seri)

pandas.core.series.Series

In [7]:
"""
.axes ile serinin başlangıç, bitiş ve adım değerlerini görebiliriz.

"""
print(seri.axes)

[RangeIndex(start=0, stop=9, step=1)]

In [8]:
"""
dtype ile serinin veri tipini görebiliriz.

"""
print(seri.dtype)

int64

In [9]:
"""
.size ile serinin boyutunu öğrenebiliriz.
.ndim ile serinin boyut sayısını görebiliriz.

"""
print(seri.size)
print(seri.ndim)

9
1

In [10]:
"""
.values ile serinin değerlerini görebiliriz.
"""
print(seri.values)

[1 2 3 4 5 6 7 8 9]

In [11]:
"""
.head() ile serinin ilk 5 değerini görebiliriz. Eğer isterseniz .head(10) diyerek ilk 10 değeri görebilirsiniz.
"""
seri.head()

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [12]:
print(seri.head(3))

0    1
1    2
2    3
dtype: int64

In [13]:
"""
.tail() ile serinin son 5 değerini görebiliriz. Eğer isterseniz .tail(10) diyerek son 10 değeri görebilirsiniz.
"""
seri.tail()

4    5
5    6
6    7
7    8
8    9
dtype: int64

In [14]:
seri.tail(3)

6    7
7    8
8    9
dtype: int64

In [17]:
seri=pd.Series([99,22,323,94,5], index=["a","b","c","d","e"])

In [18]:
print(seri["a"])

99

In [19]:
print(seri["a" : "c"])

a     99
b     22
c    323
dtype: int64

In [20]:
sozluk= {"reg":10, "log":11, "cart":12}
seri=pd.Series(sozluk)
seri

reg     10
log     11
cart    12
dtype: int64

In [21]:
randomNumbers = np.random.randint(10,100,5)
pandas = pd.Series(randomNumbers)
print(pandas[0])

25

In [22]:
seri = pd.Series([200,121,150,99], index=["a","b","c","d"])
print(seri)

a    200
b    121
c    150
d     99
dtype: int64

In [23]:
seri.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [24]:
seri.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [25]:
print(list(seri.items()))

[('a', 200), ('b', 121), ('c', 150), ('d', 99)]

In [26]:
"a" in seri

True

In [27]:
"g" in seri

False

In [29]:
seri[["a","b"]]

a    200
b    121
dtype: int64

In [30]:
seri["a"] = 250
print(seri)

a    250
b    121
c    150
d     99
dtype: int64

## Pandas DataFrame Oluşturma

pd.DataFrame()
- DataFrame oluşturabiliriz.
- columns parametresi ile kolon isimlerini belirleyebiliriz.
- index parametresi ile index isimlerini belirleyebiliriz.

In [31]:
l = [1,2,3,4,5]
pd.DataFrame(l, columns=["degisken_ismi"])

   degisken_ismi
0              1
1              2
2              3
3              4
4              5

In [32]:
m = np.arange(1,10).reshape((3,3))
pd.DataFrame(m, columns=["1","2","3"])

   1  2  3
0  1  2  3
1  4  5  6
2  7  8  9

In [33]:
df = pd.DataFrame(m, columns=["var1","var2","var3"])
df.head(2)

   var1  var2  var3
0     1     2     3
1     4     5     6

In [34]:
df.columns = {"degisken1","degisken2","degisken3"}
df

   degisken1  degisken2  degisken3
0          1          2          3
1          4          5          6
2          7          8          9

In [35]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['degisken1', 'degisken2', 'degisken3'], dtype='object')]

In [36]:
df.shape

(3, 3)

In [37]:
df.ndim

2

In [38]:
df.size

9

In [39]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [40]:
df.tail(1)

   degisken1  degisken2  degisken3
2          7          8          9

## Eleman İşlemleri

In [41]:
s1 = np.random.randint(10, size=5)
s2 = np.random.randint(10, size=5)
s3 = np.random.randint(10, size=5)

In [42]:
sozluk = {"var1": s1, "var2":s2, "var3":s3}
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     6     6     1
1     8     0     5
2     9     2     5
3     0     8     5
4     8     0     9

In [43]:
df[0:1]

   var1  var2  var3
0     6     6     1

In [44]:
df.index = ["a","b","c","d","e"]
df

   var1  var2  var3
a     6     6     1
b     8     0     5
c     9     2     5
d     0     8     5
e     8     0     9

In [45]:
df[0:1]

   var1  var2  var3
a     6     6     1

In [46]:
df["c":"e"]

   var1  var2  var3
c     9     2     5
d     0     8     5
e     8     0     9

- df.drop() ile kolon veya satır silme işlemi yapabiliriz.
- axis=1 ile kolon silme işlemi yapabiliriz.
- axis=0 ile satır silme işlemi yapabiliriz.

In [47]:
df.drop("a",axis = 0)

   var1  var2  var3
b     8     0     5
c     9     2     5
d     0     8     5
e     8     0     9

In [48]:
df

   var1  var2  var3
a     6     6     1
b     8     0     5
c     9     2     5
d     0     8     5
e     8     0     9

inplace parametresi ile değişikliği kalıcı kaydetme işlemi yapabiliriz. Diğer durumlarda değişiklikler geçici olarak kaydedilir.

In [ ]:
df.drop("a",axis=0, inplace=True)
df

In [58]:
l = ["var1","var2","var3"]
for i in l:
    print(i in l)

True
True
True

In [59]:
df["var4"] = df["var1"] / df["var2"]
df

   var1  var2  var3  var4
b     8     0     5   inf
c     9     2     5   4.5
d     0     8     5   0.0
e     8     0     9   inf

In [ ]:
df.drope("var4",axis=1,inplace=True)
df

In [62]:
l = ["var1","var2"]
df.drop(l,axis=1)

   var3  var4
b     5   inf
c     5   4.5
d     5   0.0
e     9   inf

## Gözlem ve Değişken Seçimi

In [64]:
m = np.random.randint(1,30,size=(10,3))
df = pd.DataFrame(m,columns = ["var1","var2","var3"])
df

   var1  var2  var3
0    26    16     2
1    29    13    11
2    17    25    23
3    22    15    17
4     2    16    13
5    26    14    25
6    11     8    14
7    11    14     4
8    29    27    16
9    28    22    11

## loc
- Tanımlandığı şekliyle seçim yapmak için kullanılır.

In [65]:
df.loc[0:3]

   var1  var2  var3
0    26    16     2
1    29    13    11
2    17    25    23
3    22    15    17

## iloc
- Alışık olduğumuz indexleme mantığıyla seçim yapmak için kullanılır.

In [66]:
df.iloc[0:3]

   var1  var2  var3
0    26    16     2
1    29    13    11
2    17    25    23

In [67]:
df.iloc[0,0]

26

In [68]:
df.iloc[:3,:2]

   var1  var2
0    26    16
1    29    13
2    17    25

In [69]:
df.loc[0:3,"var3"]

0     2
1    11
2    23
3    17
Name: var3, dtype: int32

In [70]:
df.iloc[0:3,0:2]

   var1  var2
0    26    16
1    29    13
2    17    25

## Koşullu Eleman İşlemleri

In [71]:
df[df.var1 > 15]

   var1  var2  var3
0    26    16     2
1    29    13    11
2    17    25    23
3    22    15    17
5    26    14    25
8    29    27    16
9    28    22    11

In [72]:
df[df.var1 % 2 ==0]

   var1  var2  var3
0    26    16     2
3    22    15    17
4     2    16    13
5    26    14    25
9    28    22    11

In [73]:
df.loc[(df.var1 > 15) & (df.var3 < 15), "var2"]

0    16
1    13
9    22
Name: var2, dtype: int32

In [74]:
df.query("var1 > 15 & var3 < 15")

   var1  var2  var3
0    26    16     2
1    29    13    11
9    28    22    11

## Birleştirme (Join) İşlemleri

In [75]:
df2 = df + 99
df2

   var1  var2  var3
0   125   115   101
1   128   112   110
2   116   124   122
3   121   114   116
4   101   115   112
5   125   113   124
6   110   107   113
7   110   113   103
8   128   126   115
9   127   121   110

.concat() fonksiyonu ile iki dataframe'i birleştirebiliriz. ignore_index parametresi ile indexleri sıfırlayabiliriz.
join parametresi ile hangi kolon üzerinden birleştirileceğini belirleyebiliriz.

In [76]:
pd.concat([df,df2])

   var1  var2  var3
0    26    16     2
1    29    13    11
2    17    25    23
3    22    15    17
4     2    16    13
5    26    14    25
6    11     8    14
7    11    14     4
8    29    27    16
9    28    22    11
0   125   115   101
1   128   112   110
2   116   124   122
3   121   114   116
4   101   115   112
5   125   113   124
6   110   107   113
7   110   113   103
8   128   126   115
9   127   121   110

In [77]:
pd.concat([df,df2], ignore_index=True)

    var1  var2  var3
0     26    16     2
1     29    13    11
2     17    25    23
3     22    15    17
4      2    16    13
5     26    14    25
6     11     8    14
7     11    14     4
8     29    27    16
9     28    22    11
10   125   115   101
11   128   112   110
12   116   124   122
13   121   114   116
14   101   115   112
15   125   113   124
16   110   107   113
17   110   113   103
18   128   126   115
19   127   121   110

In [78]:
df2.colums = ["var1","var2","var3"]
pd.concat([df,df2],join="inner")

C:\Users\leman\AppData\Local\Temp\ipykernel_15848\1946502130.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df2.colums = ["var1","var2","var3"]

   var1  var2  var3
0    26    16     2
1    29    13    11
2    17    25    23
3    22    15    17
4     2    16    13
5    26    14    25
6    11     8    14
7    11    14     4
8    29    27    16
9    28    22    11
0   125   115   101
1   128   112   110
2   116   124   122
3   121   114   116
4   101   115   112
5   125   113   124
6   110   107   113
7   110   113   103
8   128   126   115
9   127   121   110

## İleri Birleştirme İşlemleri

In [79]:
df1 = pd.DataFrame({"Çalışanlar":["Ahmet","Emirhan","Berkcan","Eslem"],
                    "Grup":["Koordinatör","Full Time Çalışan","Eğitim Koordinatörü","iş Geliştirme"]})
df1

  Çalışanlar                 Grup
0      Ahmet          Koordinatör
1    Emirhan    Full Time Çalışan
2    Berkcan  Eğitim Koordinatörü
3      Eslem        iş Geliştirme

In [80]:
df2 = pd.DataFrame({"Çalışanlar":["Ahmet","Emirhan","Berkcan","Eslem"],
                    "İlk Giriş Yılı":[2021,2019,2022,2018]})
df2

  Çalışanlar  İlk Giriş Yılı
0      Ahmet            2021
1    Emirhan            2019
2    Berkcan            2022
3      Eslem            2018

# .merge()
- .merge() fonksiyonu ile birebir birleştirme işlemlerini gerçekleştirebiliriz.
- Merge komutu ile yapılan işlemleri SQL'de bulunan inner join, outher join... 'e benzetebiliriz.

In [81]:
pd.merge(df1,df2)

  Çalışanlar                 Grup  İlk Giriş Yılı
0      Ahmet          Koordinatör            2021
1    Emirhan    Full Time Çalışan            2019
2    Berkcan  Eğitim Koordinatörü            2022
3      Eslem        iş Geliştirme            2018

In [82]:
pd.merge(df1,df2, on= "Çalışanlar")

  Çalışanlar                 Grup  İlk Giriş Yılı
0      Ahmet          Koordinatör            2021
1    Emirhan    Full Time Çalışan            2019
2    Berkcan  Eğitim Koordinatörü            2022
3      Eslem        iş Geliştirme            2018